package Objects_Methods;

public class Main {
    public static void main(String[] args) {


//        1-я ступень
//Базовый вход в трек трудоустройства начинается со знакомства со структурой карьерного центра.
//
//На этом же этапе мы знакомим учеников с инструментом для самостоятельной подготовки и проверки знаний по уже пройденной программе — телеграм-ботом, который содержит в себе теоретические и практические задания для закрепления пройденного материала.
//
//2-я ступень
//Вторая точка входа в карьерный центр включает в себя предметные уроки по техническим собеседованиям и структуре подготовки к ним, а также опыт первого реального тех. интервью с наставником. После интервью все прошедшие курс ученики получают развернутую объективную обратную связь по сильным сторонам, точкам роста и ключевые рекомендации к дальнейшим шагам.
//
//3-я ступень
//На третьем этапе ученики изучают процесс поиска работы на площадках, учатся работать с резюме, сопроводительными письмами, получают второй опыт прохождения технического интервью.
//
//На данном этапе техническое собеседование — это точка контроля уровня знаний, после которой ученик проходит в карьерный центр и изучает рынок вакансий либо получает индивидуальные рекомендации по улучшению своего опыта.
//
//4-я ступень
//Заключительный этап, на котором ученики активно погружаются в поиск работы, отклики и прохождение собеседований, проходит после завершения основной части программы и сдачи финального задания.
//
//На этом этапе ученики проходят собеседования при поддержке карьерных консультантов.
//
//Для учеников, которые пропустили третий этап и следовали индивидуальным рекомендациям, два последние этапа объединяются в один после финального курса обучения.
//
//Как выглядит процесс трудоустройства в IT
//Мы собрали серию материалов в текстовом, видео- и аудиоформате для того, чтобы расширить понимание того, как строится процесс найма нового специалиста на позицию Junior-разработчика (и не только).
//
//Материалы носят рекомендательный характер, но мы советуем с ними ознакомиться.
//
//Забегая вперед, можно с уверенностью сказать, что в каждой компании шаги и этапы собеседований могут отличаться, как и время принятия решений на каждом этапе.
//
//Это зависит от бюджетов компании на наем, ее планов развития в ближайший год, размеров самой компании.
//
//Но в общей ветке поиска новых специалистов можно выделить следующие шаги:
//
//Понимание потребности в новом специалисте и формирование бюджета под новые позиции.
//Формирование требований к кандидату: описание вакансии с должностными обязанностями и требованиями к соискателю.
//Холодный отбор среди откликнувшихся на вакансию по резюме и сопроводительным письмам.
//Первый этап. Знакомство с рекрутером и прохождение собеседования на soft skills: умение себя презентовать, отвечать на вопросы о предыдущем опыте и будущих ожиданиях.
//Второй этап. Прохождение технического интервью с техлидом или сеньор-специалистом: ответы на технические вопросы, решение практических задач.
//При удачном прохождении собеседований — получение офера, согласование условий и даты выхода на работу, скрининг системой безопасности компании.
//Дополнительно перед тем, как пройти собеседование с рекрутером, компания может попросить сделать тестовое задание или записать видеовизитку о себе.
//
//Собеседований с самим рекрутером может быть несколько или наоборот — интервью на soft skills и созвон с техлидом могут пройти друг за другом.
//
//Если необходимо, техлид может организовать еще одно интервью-знакомство с командой.
//
//Единого сценария нет, поэтому ниже мы собрали наиболее значимые материалы по данной теме:
//
//Большая статья о первом поиске работы в IT: https://tproger.ru/
//«8 советов по поиску работы, чтобы получить любимую работу разработчика»: https://javarush.ru/
//Пример резюме программиста: https://www.superjob.ru/
//Видео: публичное собеседование с кандидатом: https://www.youtube.com/
//Дополнительно мы собрали подборку материалов, аудио- и ютуб-подкастов для погружения в специфику работы в IT.
//
//Подкасты по теме IT:
//
//«Разбор Полетов» (https://razborpoletov.com/) — один из старейших подкастов в русскоязычном интернете о разработке и IT-сфере в целом.
//Хабр-подкасты (https://music.yandex.ru) — новости из мира IT, обсуждения новых технологий.
//«Подлодка» (https://podlodka.io/) — еженедельное аудиошоу про IT и всё, что с ним связано.
//«Сушите весла» (https://music.yandex.ru/) — подкаст о разработке, аналитике, тестировании и других аспектах создания приложений.
//«Запуск завтра» (https://music.yandex.ru/) — подкаст о технологиях, меняющих нашу жизнь.
//Loving IT (https://music.yandex.ru/) — новый подкаст, где ведущий вместе с гостями исследует новые цифровые профессии.
//«Гоша Дударь» (https://www.youtube.com/) — популярный русскоязычный канал о разработке на YouTube.
//«АйТиБорода» (https://www.youtube.com/) — канал опытного программиста, посвященный жизни айтишников, где ведущий берет интервью у разных лидеров мнений об их опыте.
//Подкасты не про IT:
//
//«Работник месяца» https://podcasts.apple.com/) — подкаст о людях разных профессий, не только IT-сферы.
//«Будет сделано!» (https://willbedone.ru/episodes/) — подкаст на тему личной эффективности.
//Agile Reactor Podcast (https://soundcloud.com/) — подкаст о разных форматах работы, личной эффективности и мотивации.
    }
}